Revit 2026 API

# AnalysisDisplayColoredSurfaceSettings Class

---

Contains colored surface settings for analysis display style element.

SystemObject Autodesk.Revit.DB.AnalysisAnalysisDisplayColoredSurfaceSettings

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AnalysisDisplayColoredSurfaceSettings : IDisposable
```
```vb
Public Class AnalysisDisplayColoredSurfaceSettings
	Implements IDisposable
```
```cpp
public ref class AnalysisDisplayColoredSurfaceSettings : IDisposable
```
```fsharp
type AnalysisDisplayColoredSurfaceSettings =
    class
        interface IDisposable
    end
```

The AnalysisDisplayColoredSurfaceSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AnalysisDisplayColoredSurfaceSettings | Constructs a default instance of colored surface settings. |
|  | AnalysisDisplayColoredSurfaceSettings(AnalysisDisplayColoredSurfaceSettings) | Constructs a new copy of the input AnalysisDisplayColoredSurfaceSettings object. |

|  | Name | Description |
| --- | --- | --- |
|  | GridColor | Color of grid lines. |
|  | GridLineWeight | Line weight of grid lines. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ShowContourLines | If true, show contour lines in the analysis display. |
|  | ShowGridLines | If true, show grid lines in the analysis display. |
|  | Transparency | Transparency percentage of colored surface |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the AnalysisDisplayColoredSurfaceSettings |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsEqual | Compares two colored surface settings objects. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Analysis Namespace